#+TITLE: Iterators And Clojures

** Storing closures using generic params and the ~Fn~ traits
+ when we reformulated the code to use a closure, we still call it multiple times
+ a solution to this is creating a struct that holds the closure and the cached result
  - this is /memoization/ + /layzy evaluation/

+ to hold a closure, we need to specify the type of the closure
  - each closure has its own unique anonymous type: that is, even if two closures have the same signature, their types are still considred diff
  - to define structs, enums, or func params that use closures, we use [[./10-Generic Types, Traits, Lifetimes.org][generics and trait bounds]]

+ the ~Fn~ traits are provived by the std lib
+ all closures implement at least one of the traits: ~Fn~, ~FnMut~, or ~FnOnce~ (for now, we'll use ~Fn~ only)

#+begin_src rust
use std::thread;
use std::time::Duration;

struct Cacher<T>
where
    T: Fn(u32) -> u32,
{
    calculation: T,
    value: Option<u32>,
}

impl<T> Cacher<T>
where
    T: Fn(u32) -> u32,
{
    fn new(calculation: T) -> Cacher<T> {
        Cacher {
            calculation,
            value: None,
        }
    }

    fn value(&mut self, arg: u32) -> u32 {
        match self.value {
            Some(v) => v,
            None => {
                let v = (self.calculation)(arg);
                self.value = Some(v);
                v
            }
        }
    }
}

fn generate_workout(intensity: u32, random_number: u32) {
    let mut expensive_result = Cacher::new(|num| {
        println!("calculating slowly...");
        thread::sleep(Duration::from_secs(2));
        num
    });

    if intensity < 25 {
        println!("Today, do {} pushups!", expensive_result.value(intensity));
        println!("Today, do {} situps!", expensive_result.value(intensity));
    } else {
        if random_number == 3 {
            println!("Take a break today! Remember to stay hydrated!");
        } else {
            println!(
                "Today, run for {} minutes!",
                expensive_result.value(intensity)
            );
        }
    }
}

fn main() {
    let simulated_user_specified_value = 10;
    let simulated_random_number = 7;

    generate_workout(simulated_user_specified_value, simulated_random_number);
}
#+end_src

#+RESULTS:
: calculating slowly...
: Today, do 10 pushups!
: Today, do 10 situps!

